# 0               4   5   6       8 (BYTE)
# +---------------+---+---+-------+
# |     conv      |cmd|frg|  wnd  |
# +---------------+---+---+-------+   8
# |     ts        |     sn        |
# +---------------+---------------+  16
# |     una       |     len       |
# +---------------+---------------+  24
# |                               |
# |        DATA (optional)        |
# |                               |
# +-------------------------------+

# conv 4 字节: 连接标识, 前面已经讨论过了.自己实现协商
# cmd 1 字节: Command.
#     数据报文 IKCP_CMD_PUSH
#     确认报文 IKCP_CMD_ACK
#     窗口探测报文 IKCP_CMD_WASK, 询问对端剩余接收窗口的大小.
#     窗口通知报文 IKCP_CMD_WINS, 通知对端剩余接收窗口的大小.
# frg 1 字节: 分片数量. 表示随后还有多少个报文属于同一个包.
# wnd 2 字节: 发送方剩余接收窗口的大小.
# ts 4 字节: 时间戳.
# sn 4 字节: 报文编号.
# una 4 字节: 发送方的接收缓冲区中最小还未收到的报文段的编号. 也就是说, 编号比它小的报文段都已全部接收.
# len 4 字节: 数据段长度.
# data: 数据段. 只有数据报文会有这个字段.
